MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : 42dB DSP Engine - I2S Audio Processor with BLE Control
 * @author         : Robin Kluit
 * @date           : 2026-02-04
 ******************************************************************************
 * @attention
 *
 * DSP audio processor: I2S input -> DSP processing -> I2S output
 * Control interface via ESP32 BLE GATT
 *
 * Peripherals:
 *   USART3 (Debug Console - ST-LINK VCP): PD8(TX), PD9(RX) @ 115200
 *   USART2 (ESP32 BLE Control): PD5(TX), PD6(RX) @ 115200
 *   SAI2_A (I2S Input from BM83): PD13(SCK), PD12(FS), PD11(SD) - Slave RX
 *   SAI2_B (I2S Output to DAC): PA0(SD) - Slave TX synced to SAI2_A
 *
 ******************************************************************************
 */

#include "stm32h7xx_hal.h"
#include "build_number.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/* Audio Configuration -------------------------------------------------------*/
#define AUDIO_SAMPLE_RATE       44100   /* Match ESP32 default */
#define AUDIO_BIT_DEPTH         16      /* 16-bit audio */
#define AUDIO_CHANNELS          2
#define AUDIO_BUFFER_SAMPLES    256     /* Samples per channel per half-buffer */
#define AUDIO_BUFFER_SIZE       (AUDIO_BUFFER_SAMPLES * AUDIO_CHANNELS)  /* Total samples per half */

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart2;  // ESP32 communication
UART_HandleTypeDef huart3;  // Debug console (VCP)
SAI_HandleTypeDef hsai_rx;  // SAI2_A - I2S Input (Slave RX)
SAI_HandleTypeDef hsai_tx;  // SAI2_B - I2S Output (Slave TX)
DMA_HandleTypeDef hdma_sai_rx;  // DMA for SAI2_A RX
DMA_HandleTypeDef hdma_sai_tx;  // DMA for SAI2_B TX

/* Audio Buffers - placed in D2 SRAM for DMA1/DMA2 access --------------------*/
/* IMPORTANT: DMA1/DMA2 on STM32H7 can ONLY access D2 SRAM (0x30000000)! */
/* Double buffer: DMA fills one half while we process the other */
/* 16-bit samples to match ESP32 I2S format */
__attribute__((section(".RAM_D2"))) int16_t audio_rx_buffer[AUDIO_BUFFER_SIZE * 2];
__attribute__((section(".RAM_D2"))) int16_t audio_tx_buffer[AUDIO_BUFFER_SIZE * 2];

/* Audio state */
volatile uint8_t audio_rx_half_complete = 0;
volatile uint8_t audio_rx_full_complete = 0;
volatile uint32_t audio_buffer_count = 0;
volatile uint32_t audio_overrun_count = 0;

/* Ring buffer for received data */
#define RX_BUFFER_SIZE 256
uint8_t rx_buffer[RX_BUFFER_SIZE];
volatile uint16_t rx_head = 0;
volatile uint16_t rx_tail = 0;
uint8_t rx_byte;  // Single byte for UART interrupt

/* Line buffer for GATT commands from ESP32 */
#define LINE_BUFFER_SIZE 128
char line_buffer[LINE_BUFFER_SIZE];
uint16_t line_pos = 0;

/* GATT command handler - called when complete line received */
static void Process_GATT_Command(const char *line);

/* ==========================================================================
 * DSP Processing State
 * ========================================================================== */

/* DSP feature flags */
static volatile uint8_t dsp_loudness_enabled = 0;
static volatile uint8_t dsp_mute_enabled = 0;
static volatile uint8_t dsp_bypass_enabled = 0;
static volatile uint8_t dsp_bass_boost_enabled = 0;

/* Biquad filter state for loudness (stereo - L and R channels) */
/* Low-shelf filter: boost bass frequencies (+6dB @ 100Hz) */
typedef struct {
    float x1, x2;  /* Input history */
    float y1, y2;  /* Output history */
} BiquadState;

static BiquadState loudness_state_L = {0};
static BiquadState loudness_state_R = {0};

/* Biquad coefficients for low-shelf filter
 * Calculated for: Fs=44100Hz, Fc=150Hz, Gain=+6dB, Q=0.707
 * Using Audio EQ Cookbook formula (Robert Bristow-Johnson) */
static const float loudness_b0 = 1.005260f;
static const float loudness_b1 = -1.974408f;
static const float loudness_b2 = 0.969786f;
static const float loudness_a1 = -1.974567f;
static const float loudness_a2 = 0.974887f;

/* Apply biquad filter to a single sample */
static inline float biquad_process(BiquadState *state, float input)
{
    float output = loudness_b0 * input
                 + loudness_b1 * state->x1
                 + loudness_b2 * state->x2
                 - loudness_a1 * state->y1
                 - loudness_a2 * state->y2;

    /* Shift history */
    state->x2 = state->x1;
    state->x1 = input;
    state->y2 = state->y1;
    state->y1 = output;

    return output;
}

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_SAI2_Init(void);
void Error_Handler(void);

/* Audio processing */
static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples);

/* Debug printf redirection to USART3 */
int _write(int file, char *ptr, int len)
{
    HAL_UART_Transmit(&huart3, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
}

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();          // DMA must be initialized before peripherals that use it
    MX_USART3_UART_Init();  // Debug console first

    /* Boot message with build number */
    printf("\r\n\r\n*** 42dB DSP Engine (Build #%d) ***\r\n", BUILD_NUMBER);

    printf("[OK] HAL initialized\r\n");
    printf("[OK] Clock configured\r\n");
    printf("[OK] GPIO initialized\r\n");
    printf("[OK] DMA initialized\r\n");
    printf("[OK] USART3 (debug console) initialized\r\n");

    MX_USART2_UART_Init();  // ESP32 BLE control
    printf("[OK] USART2 (ESP32 BLE) initialized\r\n");

