MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
    /* Frame: same as RX (Philips) */
    hsai_tx.FrameInit.FrameLength = 32;
    hsai_tx.FrameInit.ActiveFrameLength = 16;
    hsai_tx.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    hsai_tx.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    hsai_tx.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    /* Slots: same as RX */
    hsai_tx.SlotInit.FirstBitOffset = 0;
    hsai_tx.SlotInit.SlotSize = SAI_SLOTSIZE_16B;
    hsai_tx.SlotInit.SlotNumber = 2;
    hsai_tx.SlotInit.SlotActive = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

    if (HAL_SAI_Init(&hsai_tx) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void)
{
    /* GPIO clocks are enabled in HAL_xxx_MspInit() callbacks */
}

/**
 * @brief  Audio processing function - called for each buffer
 *         Currently just passes through (echo) for testing
 * @param  rx_buf: Pointer to received audio samples (16-bit)
 * @param  tx_buf: Pointer to transmit audio samples (16-bit)
 * @param  samples: Number of samples (L+R interleaved)
 * @retval None
 */
volatile uint32_t audio_process_count = 0;

/* Simple sine wave lookup table (256 entries, one full cycle) */
static const int16_t sine_table[256] = {
    0, 804, 1608, 2410, 3212, 4011, 4808, 5602, 6393, 7179,
    7962, 8739, 9512, 10278, 11039, 11793, 12539, 13279, 14010, 14732,
    15446, 16151, 16846, 17530, 18204, 18868, 19519, 20159, 20787, 21403,
    22005, 22594, 23170, 23731, 24279, 24811, 25329, 25832, 26319, 26790,
    27245, 27683, 28105, 28510, 28898, 29268, 29621, 29956, 30273, 30571,
    30852, 31113, 31356, 31580, 31785, 31971, 32137, 32285, 32412, 32521,
    32609, 32678, 32728, 32757, 32767, 32757, 32728, 32678, 32609, 32521,
    32412, 32285, 32137, 31971, 31785, 31580, 31356, 31113, 30852, 30571,
    30273, 29956, 29621, 29268, 28898, 28510, 28105, 27683, 27245, 26790,
    26319, 25832, 25329, 24811, 24279, 23731, 23170, 22594, 22005, 21403,
    20787, 20159, 19519, 18868, 18204, 17530, 16846, 16151, 15446, 14732,
    14010, 13279, 12539, 11793, 11039, 10278, 9512, 8739, 7962, 7179,
    6393, 5602, 4808, 4011, 3212, 2410, 1608, 804, 0, -804,
    -1608, -2410, -3212, -4011, -4808, -5602, -6393, -7179, -7962, -8739,
    -9512, -10278, -11039, -11793, -12539, -13279, -14010, -14732, -15446, -16151,
    -16846, -17530, -18204, -18868, -19519, -20159, -20787, -21403, -22005, -22594,
    -23170, -23731, -24279, -24811, -25329, -25832, -26319, -26790, -27245, -27683,
    -28105, -28510, -28898, -29268, -29621, -29956, -30273, -30571, -30852, -31113,
    -31356, -31580, -31785, -31971, -32137, -32285, -32412, -32521, -32609, -32678,
    -32728, -32757, -32767, -32757, -32728, -32678, -32609, -32521, -32412, -32285,
    -32137, -31971, -31785, -31580, -31356, -31113, -30852, -30571, -30273, -29956,
    -29621, -29268, -28898, -28510, -28105, -27683, -27245, -26790, -26319, -25832,
    -25329, -24811, -24279, -23731, -23170, -22594, -22005, -21403, -20787, -20159,
    -19519, -18868, -18204, -17530, -16846, -16151, -15446, -14732, -14010, -13279,
    -12539, -11793, -11039, -10278, -9512, -8739, -7962, -7179, -6393, -5602,
    -4808, -4011, -3212, -2410, -1608, -804
};
static uint32_t sine_phase = 0;

/**
 * @brief  Parse hex string to bytes
 * @param  hex: Input hex string (e.g., "0164")
 * @param  out: Output byte array
 * @param  max_len: Maximum bytes to parse
 * @retval Number of bytes parsed
 */
static int hex_to_bytes(const char *hex, uint8_t *out, int max_len)
{
    int len = 0;
    while (*hex && *(hex + 1) && len < max_len)
    {
        char byte_str[3] = {hex[0], hex[1], '\0'};
        out[len++] = (uint8_t)strtol(byte_str, NULL, 16);
        hex += 2;
    }
    return len;
}

/**
 * @brief  Process GATT command received from ESP32
 *         Format: GATT:<characteristic>:<hex_data>
 *         Example: GATT:CTRL:0102 (Set preset to NIGHT)
 * @param  line: Complete line without \r\n
 */
static void Process_GATT_Command(const char *line)
{
    /* Check if it's a GATT command */
    if (strncmp(line, "GATT:", 5) != 0)
    {
        printf("[ESP32] %s\r\n", line);
        return;
    }

    /* Parse: GATT:<char>:<hex> */
    const char *char_start = line + 5;
    const char *colon = strchr(char_start, ':');
    if (!colon)
    {
        printf("[ESP32] Invalid GATT format: %s\r\n", line);
        return;
    }

    /* Extract characteristic name */
    int char_len = colon - char_start;
    char char_name[32];
    if (char_len >= (int)sizeof(char_name)) char_len = sizeof(char_name) - 1;
    strncpy(char_name, char_start, char_len);
    char_name[char_len] = '\0';

    /* Extract hex data */
    const char *hex_data = colon + 1;
    uint8_t cmd_bytes[16];
    int cmd_len = hex_to_bytes(hex_data, cmd_bytes, sizeof(cmd_bytes));

    /* Log the command */
    printf("[GATT] %s:", char_name);
    for (int i = 0; i < cmd_len; i++)
    {
        printf(" %02X", cmd_bytes[i]);
    }
    printf("\r\n");

    /* Handle specific commands - accept any characteristic that ends with "CTRL" or "TRL"
     * to handle occasional UART byte loss */
    if ((strstr(char_name, "CTRL") != NULL || strstr(char_name, "TRL") != NULL) && cmd_len >= 2)
    {
        uint8_t cmd_type = cmd_bytes[0];
        uint8_t cmd_value = cmd_bytes[1];

        switch (cmd_type)
        {
            case 0x01:  /* Set Preset */
                printf("[DSP] Set preset: %d\r\n", cmd_value);
                /* TODO: Apply preset to DSP */
                break;
            case 0x02:  /* Set Loudness */
                printf("[DSP] Loudness: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_loudness_enabled = cmd_value ? 1 : 0;
                if (!cmd_value) {
                    /* Reset filter state when disabling to avoid clicks */
                    memset(&loudness_state_L, 0, sizeof(loudness_state_L));
                    memset(&loudness_state_R, 0, sizeof(loudness_state_R));
                }
                break;
            case 0x04:  /* Set Mute */
                printf("[DSP] Mute: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_mute_enabled = cmd_value ? 1 : 0;
                break;
            case 0x07:  /* Set Volume */
                printf("[DSP] Volume: %d%%\r\n", cmd_value);
                /* TODO: Apply volume */
                break;
            case 0x08:  /* Set Bypass */
                printf("[DSP] Bypass: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_bypass_enabled = cmd_value ? 1 : 0;
                break;
            case 0x09:  /* Set Bass Boost */
                printf("[DSP] Bass Boost: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_bass_boost_enabled = cmd_value ? 1 : 0;
                break;
            default:
                printf("[DSP] Unknown command: 0x%02X\r\n", cmd_type);
                break;
        }
    }
}

static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples)
{
    audio_process_count++;

    /* Bypass mode: direct passthrough without any processing */
    if (dsp_bypass_enabled)
    {
        memcpy(tx_buf, rx_buf, samples * sizeof(int16_t));
        return;
    }

