MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
    /* Process stereo samples (L, R, L, R, ...) */
    for (uint16_t i = 0; i < samples; i += 2)
    {
        /* Get input samples as float (-1.0 to 1.0 range) */
        float left_in  = (float)rx_buf[i]     / 32768.0f;
        float right_in = (float)rx_buf[i + 1] / 32768.0f;

        float left_out  = left_in;
        float right_out = right_in;

        /* Apply DSP chain */

        /* 1. Loudness: Low-shelf bass boost */
        if (dsp_loudness_enabled)
        {
            left_out  = biquad_process(&loudness_state_L, left_out);
            right_out = biquad_process(&loudness_state_R, right_out);
        }

        /* 2. Mute: Zero output */
        if (dsp_mute_enabled)
        {
            left_out  = 0.0f;
            right_out = 0.0f;
        }

        /* Soft clipping to prevent harsh distortion */
        if (left_out > 1.0f) left_out = 1.0f;
        if (left_out < -1.0f) left_out = -1.0f;
        if (right_out > 1.0f) right_out = 1.0f;
        if (right_out < -1.0f) right_out = -1.0f;

        /* Convert back to 16-bit integer */
        tx_buf[i]     = (int16_t)(left_out  * 32767.0f);
        tx_buf[i + 1] = (int16_t)(right_out * 32767.0f);
    }
}

/**
 * @brief  SAI Rx Half Complete callback - copy to TX for passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
    if (hsai->Instance == SAI2_Block_A)
    {
        Audio_Process(audio_rx_buffer, audio_tx_buffer, AUDIO_BUFFER_SIZE);
        audio_buffer_count++;
    }
}

/**
 * @brief  SAI Rx Complete callback - copy to TX for passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
    if (hsai->Instance == SAI2_Block_A)
    {
        Audio_Process(&audio_rx_buffer[AUDIO_BUFFER_SIZE],
                     &audio_tx_buffer[AUDIO_BUFFER_SIZE], AUDIO_BUFFER_SIZE);
        audio_buffer_count++;
    }
}

/**
 * @brief  SAI Tx Half Complete callback - RX callback handles passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
    (void)hsai;
}

/**
 * @brief  SAI Tx Complete callback - RX callback handles passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_TxCpltCallback(SAI_HandleTypeDef *hsai)
{
    (void)hsai;
}

/**
 * @brief  SAI Error callback
 * @param  hsai: SAI handle
 * @retval None
 */
volatile uint32_t sai_error_count_a = 0;
volatile uint32_t sai_error_count_b = 0;
volatile uint32_t sai_last_error_a = 0;
volatile uint32_t sai_last_error_b = 0;

void HAL_SAI_ErrorCallback(SAI_HandleTypeDef *hsai)
{
    if (hsai->Instance == SAI2_Block_A)
    {
        sai_error_count_a++;
        sai_last_error_a = hsai->ErrorCode;
        /* Just clear flags, don't restart DMA from interrupt */
        __HAL_SAI_CLEAR_FLAG(hsai, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET);
    }
    else if (hsai->Instance == SAI2_Block_B)
    {
        sai_error_count_b++;
        sai_last_error_b = hsai->ErrorCode;
        __HAL_SAI_CLEAR_FLAG(hsai, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET);
    }
}

/**
 * @brief  Rx Transfer completed callback
 * @param  huart UART handle
 * @retval None
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        /* Store byte in ring buffer */
        rx_buffer[rx_head] = rx_byte;
        rx_head = (rx_head + 1) % RX_BUFFER_SIZE;

        /* Continue receiving */
        HAL_UART_Receive_IT(&huart2, &rx_byte, 1);
    }
}

/**
 * @brief  UART Error callback - required for continuous reception
 * @param  huart UART handle
 * @retval None
 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        /* Abort resets the HAL state machine properly */
        HAL_UART_Abort(huart);

        /* Clear all error flags */
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_PEF | UART_CLEAR_FEF |
                              UART_CLEAR_NEF | UART_CLEAR_OREF);

        /* Re-arm reception */
        HAL_UART_Receive_IT(&huart2, &rx_byte, 1);
    }
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1)
    {
    }
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
}
#endif /* USE_FULL_ASSERT */
